posts/2013-05-11-sources-of-offline-documentation.org
#+title: Offline documentation
#+date: <2013-05-11 00:00>

Offline documentation reference == speedy access and maybe some tooling included.

[[https://zealdocs.org/][zeal]] is a decent offline document browser on Linux, compatible with dash docsets, one of the first offline document browsers that helped popularize offline browser references). There is even an [[https://github.com/dash-docs-el/dash-docs][emacs package]] for browsing dash docsets.

https://devdocs.io/ is a no setup required documentation browser with offline capabilities (PWA-type of thing).

