sources-of-offline-documentation.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-06-18 Wed 16:53 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0" />
<title>Offline documentation</title>
<meta name="generator" content="Org Mode" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="apple-touch-icon" sizes="180x180" href="./apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="./favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="./favicon-16x16.png">
<meta property="og:title" content="Offline documentation">
<meta property="og:description" content="">
<meta property="og:image" content="https://notes.neeasade.net/assets/img/backgrounds/newfeather.png">
<meta property="og:url" content="https://notes.neeasade.net/sources-of-offline-documentation.html">
<meta property="description" content="">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='/assets/css/colors.css?sum=7ca3a7d19d77e07a7aa1b75c41b6c485'>
<link rel='stylesheet' href='./assets/css/colors.css?sum=7ca3a7d19d77e07a7aa1b75c41b6c485'>
<link rel='stylesheet' href='/assets/css/new.css?sum=8ded96c4e22d9cf406740e90fb2c41de'>
<link rel='stylesheet' href='./assets/css/new.css?sum=8ded96c4e22d9cf406740e90fb2c41de'>
<link rel='stylesheet' href='/assets/css/org.css?sum=6f5b128ae2001f1230d4fdc21163a4d6'>
<link rel='stylesheet' href='./assets/css/org.css?sum=6f5b128ae2001f1230d4fdc21163a4d6'>
<link rel='stylesheet' href='/assets/css/notes.css?sum=444396e7a7768e08c9594d95c6234b4a'>
<link rel='stylesheet' href='./assets/css/notes.css?sum=444396e7a7768e08c9594d95c6234b4a'>
</head>
<body>
<div id="content" class="content">
<div style="float: left">
    <a href='/index.html'>../ＳＴＸ</a>
</div>

<div style="float: right">
    
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/2013-05-11-sources-of-offline-documentation.org">source</a>
</div>
<h1 class=title>Offline documentation</h1>
<div class="org-center">
<p>

</p>
</div>
<div class=pubinfo
Published 2013-05-11, last edit <a href="https://github.com/neeasade/neeasade.github.io/commits/source/posts/2013-05-11-sources-of-offline-documentation.org">2020-08-14</a>
</div>
<hr>
<p>
Offline documentation reference == speedy access and maybe some tooling included.
</p>

<p>
<a href="https://zealdocs.org/">zeal</a> is a decent offline document browser on Linux, compatible with dash docsets, one of the first offline document browsers that helped popularize offline browser references). There is even an <a href="https://github.com/dash-docs-el/dash-docs">emacs package</a> for browsing dash docsets.
</p>

<p>
<a href="https://devdocs.io/">https://devdocs.io/</a> is a no setup required documentation browser with offline capabilities (PWA-type of thing).
</p>


<div class="footer-center">
    
</div>
</div>
</body>
</html>
